A1/httperf-logs/simple/test3.txt
httperf --client=0/1 --server=localhost --port=18000 --uri=/www.cs.toronto.edu/~ylzhang/csc258/memes.html --rate=3000 --send-buffer=4096 --recv-buffer=16384 --num-conns=3000 --num-calls=1
Maximum connect burst length: 13

Total: connections 3000 requests 3000 replies 3000 test-duration 2.060 s

Connection rate: 1456.2 conn/s (0.7 ms/conn, <=199 concurrent connections)
Connection time [ms]: min 0.2 avg 65.8 max 1987.7 median 1.5 stddev 261.8
Connection time [ms]: connect 56.5
Connection length [replies/conn]: 1.000

Request rate: 1456.2 req/s (0.7 ms/req)
Request size [B]: 107.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 9.4 transfer 0.0
Reply size [B]: header 90.0 content 4148.0 footer 0.0 (total 4238.0)
Reply status: 1xx=0 2xx=3000 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.15 system 1.83 (user 7.4% system 88.8% total 96.2%)
Net I/O: 6178.9 KB/s (50.6*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0